Revit 2027 API
ExternalCommandsData.AvailabilityClassName Property
 The full class name for the class providing the entry point to decide availability of this menu item.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string AvailabilityClassName { get; set; }
Public Property AvailabilityClassName As String
	Get
	Set
public:
property String^ AvailabilityClassName {
	String^ get ();
	void set (String^ value);
}
member AvailabilityClassName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 This is the class implementing IExternalCommandAvailability interface.
See Also
Reference
ExternalCommandsData Class
Autodesk.Revit.UI Namespace